In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('../Datasets/cleaned_data.csv')

In [4]:
df.head(5)

,Status,Age Group,Education,Industry,Location,AI Risk,Years of Experience,Monthly Salary (INR),Date Recorded
0,Employed,25-34,High school,Technology,Urban,High,18.0,40700.0,2023-01-01
1,Employed,18-24,Diploma,Finance,Rural,Medium,15.0,17500.0,2023-01-02
2,Employed,25-34,High school,Retail,Delhi,Low,16.0,77600.0,2023-01-03
3,Unemployed,18-24,Master's,Retail,Urban,Low,30.0,100200.0,2023-01-04
4,Employed,45-54,Diploma,Finance,Hyderabad,Low,9.0,19500.0,2023-01-05

In [5]:
# Featuring "Status"
df['Status'] = df['Status'].map({
    'Employed': 1,
    'Unemployed': 0
})

In [6]:
# Featuring "Age Group"
age_map = {
    '18-24': 1,
    '25-34': 2,
    '35-44': 3,
    '45-54':4,
    '55+': 5
}

df['Age Group'] = df['Age Group'].map(age_map)

In [7]:
# Featuring "Education"
education_map={
    'High school':1,
    'Diploma':2,
    "Bachelor's":3,
    "Master's":4,
    'PhD':5
}

df['Education']=df['Education'].map(education_map)

In [8]:
# Featuring "Industry" and "Location"
df = pd.get_dummies(df, columns=['Industry', 'Location'], dtype=int)

In [9]:
# Featuring "AI Risk"

ai_risk_map = {
    'Low': 1,
    'Medium': 2,
    'High': 3
}

df['AI Risk'] = df['AI Risk'].map(ai_risk_map)

In [10]:
# Featuring "Date Recorded"
df['Date Recorded']=pd.to_datetime(df['Date Recorded'])
df['Year']=df['Date Recorded'].dt.year
df['Month']=df['Date Recorded'].dt.month
df['Day']=df['Date Recorded'].dt.day
df.drop('Date Recorded', axis=1, inplace=True)

In [11]:
df.shape

(2000, 21)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 21 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Status                2000 non-null   int64
 1   Age Group             2000 non-null   int64
 2   Education             2000 non-null   int64
 3   AI Risk               2000 non-null   int64
 4   Years of Experience   2000 non-null   float64
 5   Monthly Salary (INR)  2000 non-null   float64
 6   Industry_Education    2000 non-null   int64
 7   Industry_Finance      2000 non-null   int64
 8   Industry_Healthcare   2000 non-null   int64
 9   Industry_Retail       2000 non-null   int64
 10  Industry_Technology   2000 non-null   int64
 11  Location_Bangalore    2000 non-null   int64
 12  Location_Delhi        2000 non-null   int64
 13  Location_Hyderabad    2000 non-null   int64
 14  Location_Mumbai       2000 non-null   int64
 15  Location_Rural        2000 non-null   int64
 16  Location_Suburban     2000 non-null   int64
 17  Location_Urban        2000 non-null   int64
 18  Year                  2000 non-null   int32
 19  Month                 2000 non-null   int32
 20  Day                   2000 non-null   int32
dtypes: float64(2), int32(3), int64(16)
memory usage: 304.8 KB

In [13]:
df.isnull().sum()

Status                  0
Age Group               0
Education               0
AI Risk                 0
Years of Experience     0
Monthly Salary (INR)    0
Industry_Education      0
Industry_Finance        0
Industry_Healthcare     0
Industry_Retail         0
Industry_Technology     0
Location_Bangalore      0
Location_Delhi          0
Location_Hyderabad      0
Location_Mumbai         0
Location_Rural          0
Location_Suburban       0
Location_Urban          0
Year                    0
Month                   0
Day                     0
dtype: int64

In [14]:
df.head()

,Status,Age Group,Education,AI Risk,Years of Experience,Monthly Salary (INR),Industry_Education,Industry_Finance,Industry_Healthcare,Industry_Retail,...,Location_Bangalore,Location_Delhi,Location_Hyderabad,Location_Mumbai,Location_Rural,Location_Suburban,Location_Urban,Year,Month,Day
0,1,2,1,3,18.0,40700.0,0,0,0,0,...,0,0,0,0,0,0,1,2023,1,1
1,1,1,2,2,15.0,17500.0,0,1,0,0,...,0,0,0,0,1,0,0,2023,1,2
2,1,2,1,1,16.0,77600.0,0,0,0,1,...,0,1,0,0,0,0,0,2023,1,3
3,0,1,4,1,30.0,100200.0,0,0,0,1,...,0,0,0,0,0,0,1,2023,1,4
4,1,4,2,1,9.0,19500.0,0,1,0,0,...,0,0,1,0,0,0,0,2023,1,5